https://github.com/okovtun/BV_122.git
https://www.youtube.com/watch?v=htkSiXnrqHQ&list=PLeqyOOqxeiIMc8VmOKgzH2KDPzAhl5Gc3&index=1

TODO:
Вывести на экран хотябы 2 первых реугольника:https://github.com/okovtun/BD_011/blob/master/ControlStructures/Geometria1.txt

DONE:
Используя вложенные for-ы вывести на экран:
1. Таблицу умножения;
2. Таблицу Пифагора;

DONE:
1. Используя цикл for вычислить факториал числа, введенного с клавиатуры.
	5! = 1*2*3*4*5 = 120;
2. Используя цикл for, (и НЕ используя функцию pow()!!!) возвести число в указанную степень;
3. Вывести на экран таблицу ASCII-символов, разделенных пробелами, по 16 символов в строке;

TOREAD:
http://cplusplus.com/doc/tutorial/operators/
https://neerc.ifmo.ru/wiki/index.php?title=%D0%9F%D0%BE%D0%B1%D0%B8%D1%82%D0%BE%D0%B2%D1%8B%D0%B5_%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%B8
https://tproger.ru/translations/bitwise-operations/

https://www.ixbt.com/cpu/x86-cpu-faq-2006.shtml
https://www.ixbt.com/cpu/cpu-digest-2009.shtml#02
https://github.com/okovtun/BV_122/blob/master/DataTypes/DataTypes.pdf

ONLINE COMPILER
http://cpp.sh/

TODO:
Выучить преобразование типов.

DONE:
Написать программу 3Dshooter, которая, в зависимости от нажатой клавиши WASD
выведит на экран действие:
W - вперед;
S - назад;
A - влево;
D - вправо;
Space (Пробел) - прыжок;
Enter - огонь;
Escape - выход;
При нажатии на Escape программа завершается

DONE:
Пользователь вводит число с клавиатуры. Программа должна определеить,
является ли введенное число палиндромом.
Палиндром - это число или слово, которое в обоих направлениях читается одинаково.
Например:
121
1221
12321
123454321

DONE:
Поменять местами дву переменные без использования третьей переменной 
И БЕЗ ИСПОЛЬЗОВАНИЯ ФУНКЦИИ swap(), 
используя побитовые операции, и составные присваивания
Подсказка: RAID-5.

DONE:
int i = 3;
i = ++i + 1 + ++i * 2;
cout << i << endl;	//Ответ
---------------------------------------------------
int i = 3;
i = ++i + 1 + ++i *= 2;
cout << i << endl;	//Ответ
---------------------------------------------------
int i = 3;
i += i++ + 1 + ++i *= 2;
cout << i << endl;	//Ответ
---------------------------------------------------

TODO:
Есть дву переменные произвольного типа (тип обеих переменных один и тот же), 
которые пользователь вводит с клавиатуры.
Ножно вывести эти две переменные на экран, после чего поменять их значения местами, 
и вывести на экран в том же порядке, поссле замены.
	cout << a << "\t" << b << endl;
	//здесь меняем перемеенные местами
	cout << a << "\t" << b << endl;

DONE:
Решить задачи со 2-й по 4-ю из файла: https://github.com/okovtun/BV_122/blob/master/DataTypes/VariablesTask.pdf
В MyStat прислать исходный код программы.

DONE:
1. Выучить теорию!!!
2. Сколько комбинаций можно перебрать при помощи двух Байт?
3. Сколько комбинаций можно перебрать при помощи трех Байт?
4. Сколько комбинаций можно перебрать при помощи четырех Байт?
5. Сколько слов (комбинаций) можно составить при помощи пяти Русских букв?
6. Пароль может состоять из символов латинского алфавита, строчных и заглавных и
   символов цифр, минимальная длина пароля - 8 символов. 
   Сколько всего паролей минимальной длины можно составить?

DONE:
2. Вывести в консоль стишок "В лесу родилась Ёлочка". Стишок должн быть выровнен по середине окна консоли, и куплеты должны быть разделены пустой строкой. В MyStat прислать исходный код программы.