https://github.com/okovtun/BV_122.git
https://www.youtube.com/watch?v=htkSiXnrqHQ&list=PLeqyOOqxeiIMc8VmOKgzH2KDPzAhl5Gc3&index=1

TOREAD:
https://www.ixbt.com/cpu/x86-cpu-faq-2006.shtml
https://www.ixbt.com/cpu/cpu-digest-2009.shtml#02
https://github.com/okovtun/BV_122/blob/master/DataTypes/DataTypes.pdf

TODO:
Есть дву переменные произвольного типа, которые пользователь вводит с клавиатуры.
Ножно вывести эти две переменные на экран, после чего поменять их значения местами, 
и вывести на экран в том же порядке, поссле замены.
	cout << a << "\t" << b << endl;
	//здесь меняем перемеенные местами
	cout << a << "\t" << b << endl;

DONE:
Решить задачи со 2-й по 4-ю из файла: https://github.com/okovtun/BV_122/blob/master/DataTypes/VariablesTask.pdf
В MyStat прислать исходный код программы.

DONE:
1. Выучить теорию!!!
2. Сколько комбинаций можно перебрать при помощи двух Байт?
3. Сколько комбинаций можно перебрать при помощи трех Байт?
4. Сколько комбинаций можно перебрать при помощи четырех Байт?
5. Сколько слов (комбинаций) можно составить при помощи пяти Русских букв?
6. Пароль может состоять из символов латинского алфавита, строчных и заглавных и
   символов цифр, минимальная длина пароля - 8 символов. 
   Сколько всего паролей минимальной длины можно составить?

DONE:
2. Вывести в консоль стишок "В лесу родилась Ёлочка". Стишок должн быть выровнен по середине окна консоли, и куплеты должны быть разделены пустой строкой. В MyStat прислать исходный код программы.