#include<iostream>//cin/cout
//include - подключить, включить(в состав)
using namespace std;

//Глобальное пространство имен (Global scope)

void main()
{
	setlocale(LC_ALL, "");	//Устанавливаем русскую кодировку.
	cout << "\t\t\t\t\tHello \"World\"\n";
	cout <<	"ПриветМир\n" << endl;//endl - end line аналог "\n"
	cout << "\nC:\\Windows\\System32\\drivers\\\n";
	///////////////////////////////
	cout << "\n";
	cout << endl;
	//Эти две строки приводят к одному и тому же результату
	///////////////////////////////
}

//Ctrl + F7 - Компиляция
//Ctrl + F5 - Запуск

/*
-----------------------------------
cout - Console Out - это поток вывода на экран, 

"HelloWorld" - строковая константа.
-----------------------------------
*/

/*
---------------------------------------------------------------
Escape-последовательности (Esc)
/ - Slash (Косая черта)
\ - Backslash (Обратная косая черта)
\" - Отменяет особое значение двойных кавычек;
\\ - Отменяет особое значение \;

\n - newline, переводит курсор в начало следующей строки;
\t - tab, выводит в окно консоли символ табуляции.


---------------------------------------------------------------
*/

//Строчные 

/*
	Блочные
*/